{"pageProps":{"postData":{"id":"animated-highlight","contentHtml":"<p>Part of my motivation for making this site is to have a platform for reimplementing cool things that I see across the web as learning exercises.\nYes, it is easy enough to make a small repos every time, but I get bogged down with boilerplate and lose motivation before starting the actual thing.\nI saw some blog that had an animated highlight of a key point when you scrolled into view.\nSo, I copied it.</p>\n<p><a href=\"https://kng.nz/things/animated-highlight\">View a demo</a></p>\n<p><a href=\"https://github.com/timdk/kng.nz/tree/main/src/components/shared/highlight\">View the source</a></p>\n<h2>How does it work?</h2>\n<p>The highlight itself is done by animating a coloured background on an element.\nIf the element is inline then it spans multiple lines nicely.\nThe background is a linear gradient with no gradient (50/50 two-tone).\nIt is twice the width of the element, so it appears as just one of the colours.\nWhen we add the second class we animate the background position and the other colour slides in.</p>\n<pre><code>.highlight {\n  padding: 0 0.2em;\n  background-image: linear-gradient(to right, $color 50%, $color-filled 50%);\n  background-size: 200% 100%;\n  transition: background-position;\n  transition-delay: 0.5s;\n  transition-timing-function: cubic-bezier(0.65, 1, 1, 1);\n}\n\n.filled {\n  background-position: -100% 0;\n}\n</code></pre>\n<p>We want the highlight to appear in viewport so use an <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Intersection_Observer_API\">Intersection Observer</a> to apply the class when it appears in the viewport.\nI configured it with this callback and these options:</p>\n<pre><code>const observer = new IntersectionObserver((entries) => {\n  entries.forEach((entry) => {\n    if (entry.isIntersecting) {\n      entry.target.classList.add('filled')\n    }\n  })\n}, {\n  root: null,\n  rootMargin: '0px',\n  threshold: 1.0,\n})\n</code></pre>\n<p>If the root node in the options is <code>null</code> it uses the viewport.\nThreshold of 1 means it triggers when the entire element is in the viewport.\nThe <code>transition-delay</code> on the highlight delays it slightly after it becomes visible.</p>\n<p>I implemented it as a React component so I added a ref to the node and handle the observer inside the <code>useEffect</code> hook.</p>\n<p>During testing, I noticed that with longer text a fixed duration means it animates too fast.\nSo, I scale the animation duration with the number of characters.\nIt's currently a linear function, but I think it goes too slow with long texts and a logarithmic function would be better.\nIt's good enough for now given you probably don't want to highlight big matches of text, just key points.</p>\n","title":"Made a thing: Animated Highlight","date":"2022-06-27"}},"__N_SSG":true}